src/AccumulationRegisters/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/CommonModules/ПартионныйУчетСервер/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Партионный учет себестоимости по методу FIFO.
//
// Партия - документ ПоступлениеТоваров. Списание идет с самой ранней партии (по моменту времени
// документа поступления) на конкретном складе. Остатки партий читаются на момент проводимого
// документа, не включая его самого, - поэтому расчет корректен и при перепроведении.
//
// Вызывающий код обязан заранее установить исключительную управляемую блокировку
// на регистр ПартииТоваров по ключам (Номенклатура, Склад), иначе параллельные документы
// могут списать одну и ту же партию.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Рассчитывает списание партий по методу FIFO.
//
// Параметры:
//  ТаблицаСписания - ТаблицаЗначений - что нужно списать; колонки:
//   * Номенклатура - СправочникСсылка.Номенклатура
//   * Склад - СправочникСсылка.Склады
//   * Количество - Число
//  МоментВремени - МоментВремени - момент проводимого документа; остатки партий берутся до него.
//
// Возвращаемое значение:
//  Структура:
//   * Списание - ТаблицаЗначений - Номенклатура, Склад, Партия, Количество, Стоимость.
//   * Нехватка - ТаблицаЗначений - Номенклатура, Склад, Количество: сколько не покрыто партиями.
//
Функция РассчитатьСписаниеFIFO(ТаблицаСписания, МоментВремени) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Списание", НоваяТаблицаСписанияПартий());
	Результат.Вставить("Нехватка", НоваяТаблицаНехватки());

	Если ТаблицаСписания.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Партии = ОстаткиПартийПоFIFO(ТаблицаСписания, МоментВремени);

	ОтборПартий = Новый Структура("Номенклатура, Склад");
	Для Каждого СтрокаСписания Из ТаблицаСписания Цикл

		ОсталосьСписать = СтрокаСписания.Количество;
		ЗаполнитьЗначенияСвойств(ОтборПартий, СтрокаСписания);

		Для Каждого Партия Из Партии.НайтиСтроки(ОтборПартий) Цикл

			Если ОсталосьСписать <= 0 Тогда
				Прервать;
			КонецЕсли;
			Если Партия.Количество <= 0 Тогда
				Продолжить;
			КонецЕсли;

			КоличествоСписания = Мин(ОсталосьСписать, Партия.Количество);

			// Партия списывается целиком - забираем всю остаточную стоимость, чтобы не оставить
			// копеечный "хвост" от округления. Частично - пропорционально количеству.
			Если КоличествоСписания = Партия.Количество Тогда
				СтоимостьСписания = Партия.Стоимость;
			Иначе
				СтоимостьСписания = Окр(Партия.Стоимость * КоличествоСписания / Партия.Количество, 2);
			КонецЕсли;

			СтрокаРезультата = Результат.Списание.Добавить();
			СтрокаРезультата.Номенклатура = СтрокаСписания.Номенклатура;
			СтрокаРезультата.Склад = СтрокаСписания.Склад;
			СтрокаРезультата.Партия = Партия.Партия;
			СтрокаРезультата.Количество = КоличествоСписания;
			СтрокаРезультата.Стоимость = СтоимостьСписания;

			// Уменьшаем остаток партии: если в таблице списания ключ повторится,
			// повторно списать ту же партию не получится.
			Партия.Количество = Партия.Количество - КоличествоСписания;
			Партия.Стоимость = Партия.Стоимость - СтоимостьСписания;
			ОсталосьСписать = ОсталосьСписать - КоличествоСписания;

		КонецЦикла;

		Если ОсталосьСписать > 0 Тогда
			СтрокаНехватки = Результат.Нехватка.Добавить();
			СтрокаНехватки.Номенклатура = СтрокаСписания.Номенклатура;
			СтрокаНехватки.Склад = СтрокаСписания.Склад;
			СтрокаНехватки.Количество = ОсталосьСписать;
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Сообщает о товарах, которые не удалось списать по партиям.
//
// Параметры:
//  Нехватка - ТаблицаЗначений - таблица Нехватка из результата РассчитатьСписаниеFIFO.
//  Документ - ДокументСсылка - документ, к которому привязываются сообщения.
//  Отказ - Булево - устанавливается в Истина, если нехватка есть.
//
Процедура СообщитьОНехваткеПартий(Нехватка, Документ, Отказ) Экспорт

	Для Каждого СтрокаНехватки Из Нехватка Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Недостаточно товара «%1» на складе «%2» на момент документа: не хватает %3'"),
				СтрокаНехватки.Номенклатура, СтрокаНехватки.Склад,
				ОбщегоНазначенияКлиентСервер.ПредставлениеКоличества(СтрокаНехватки.Количество)),
			Документ, , , Отказ);
	КонецЦикла;

КонецПроцедуры

// Создает пустую таблицу списания партий с типизированными колонками
// (типы нужны, чтобы таблицу можно было передать в запрос параметром).
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Номенклатура, Склад, Партия, Количество, Стоимость.
//
Функция НоваяТаблицаСписанияПартий() Экспорт

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Таблица.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	Таблица.Колонки.Добавить("Партия", Новый ОписаниеТипов("ДокументСсылка.ПоступлениеТоваров"));
	Таблица.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	Таблица.Колонки.Добавить("Стоимость", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));

	Возврат Таблица;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Остатки партий по ключам списания, упорядоченные от самой ранней партии к самой поздней.
//
// Параметры:
//  ТаблицаСписания - ТаблицаЗначений - колонки Номенклатура, Склад (типизированные).
//  МоментВремени - МоментВремени - остатки берутся до этого момента, не включая его.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Номенклатура, Склад, Партия, Количество, Стоимость.
//
Функция ОстаткиПартийПоFIFO(ТаблицаСписания, МоментВремени)

	Ключи = ТаблицаСписания.Скопировать(, "Номенклатура, Склад");
	Ключи.Свернуть("Номенклатура, Склад");

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ключи", Ключи);
	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени, ВидГраницы.Исключая));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ключи.Номенклатура КАК Номенклатура,
	|	Ключи.Склад КАК Склад
	|ПОМЕСТИТЬ ВТКлючи
	|ИЗ
	|	&Ключи КАК Ключи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииОстатки.Номенклатура КАК Номенклатура,
	|	ПартииОстатки.Склад КАК Склад,
	|	ПартииОстатки.Партия КАК Партия,
	|	ПартииОстатки.КоличествоОстаток КАК Количество,
	|	ПартииОстатки.СтоимостьОстаток КАК Стоимость
	|ИЗ
	|	РегистрНакопления.ПартииТоваров.Остатки(
	|			&Граница,
	|			(Номенклатура, Склад) В
	|				(ВЫБРАТЬ
	|					ВТКлючи.Номенклатура КАК Номенклатура,
	|					ВТКлючи.Склад КАК Склад
	|				ИЗ
	|					ВТКлючи КАК ВТКлючи)) КАК ПартииОстатки
	|ГДЕ
	|	ПартииОстатки.КоличествоОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПартииОстатки.Партия.МоментВремени";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция НоваяТаблицаНехватки()

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Таблица.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	Таблица.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));

	Возврат Таблица;

КонецФункции

#КонецОбласти
